ntrcn='Электростанция' #назначена переменная в виде строки
print(ntrcn) #вывод переменной на экран
print(ntrcn[0]) #вывод на экран первого символа переменной
print(ntrcn[-1])  #вывод на экран последнего символа переменной
print(ntrcn[7:]) #вывод на экран второй половины символов переменной
print(ntrcn[7::2]) #вывод на экан нечетных символов второй половины строки
print(ntrcn[::-1]) #вывод симмволов переменной наоборот
print(ntrcn[1::2]) #вывод на экран каждого второго символа пременной
print(ntrcn[8:11]+ntrcn[2]+ntrcn[-3]) # была электростанция, стал танец
